In [1]:
import numpy as np 
import pandas as pd

In [2]:
data = ['a','b','c','d','e']

In [3]:
s = pd.Series(np.random.randn(5), index=data)

In [4]:
s

a    0.258031
b    2.007093
c   -0.409703
d    1.317201
e    0.224081
dtype: float64

In [5]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
pd.Series(np.random.rand(5))

0    0.803740
1    0.720031
2    0.122217
3    0.818910
4    0.676975
dtype: float64

In [7]:
d = {'b':1, 'a':0, 'c':2}

pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [8]:
pd.Series(4, index = data)

a    4
b    4
c    4
d    4
e    4
dtype: int64

In [9]:
s[0]

0.2580312165723718

In [10]:
s[:3]

a    0.258031
b    2.007093
c   -0.409703
dtype: float64

In [11]:
s.median()

0.2580312165723718

In [12]:
s[s > s.median()]

b    2.007093
d    1.317201
dtype: float64

In [13]:
np.exp(s)

a    1.294379
b    7.441652
c    0.663847
d    3.732958
e    1.251173
dtype: float64

In [14]:
s.to_numpy()

array([ 0.25803122,  2.00709293, -0.40970319,  1.31720086,  0.22408127])

In [15]:
s['e'] = 12

In [16]:
s

a     0.258031
b     2.007093
c    -0.409703
d     1.317201
e    12.000000
dtype: float64

rs['f']

In [18]:
s + s

a     0.516062
b     4.014186
c    -0.819406
d     2.634402
e    24.000000
dtype: float64

In [20]:
s1 = s[1:]
s2 = s[:-1]
s1 + s2

a         NaN
b    4.014186
c   -0.819406
d    2.634402
e         NaN
dtype: float64

In [21]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
         'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [22]:
df = pd.DataFrame(d)

In [23]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [24]:
pd.DataFrame(d, index = ['d','b','a'] )

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [25]:
pd.DataFrame(d, index = ['d','b','a'], columns = ['two', 'three'] )

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [26]:
d = {'one': [1., 2., 3., 4.],
         'two': [4., 3., 2., 1.]}

pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [27]:
pd.DataFrame(d, index = ['a','b','c','d'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [28]:
pd.DataFrame(pd.Series(np.random.randn(5), name='something'))

   something
0  -0.508525
1  -1.915036
2   0.808017
3   1.447539
4  -0.914223

In [29]:
df['three'] = df['one'] * df['two']
df['flag'] = df['one'] > 2 
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [30]:
del df['two']

In [31]:
df

   one  three   flag
a  1.0    1.0  False
b  2.0    4.0  False
c  3.0    9.0   True
d  NaN    NaN  False

In [32]:
df['foo']='bar'

In [33]:
df['one_trunc']=df['one'][:2]

In [34]:
df

   one  three   flag  foo  one_trunc
a  1.0    1.0  False  bar        1.0
b  2.0    4.0  False  bar        2.0
c  3.0    9.0   True  bar        NaN
d  NaN    NaN  False  bar        NaN

In [36]:
df = pd.DataFrame(np.random.randn(8, 3), columns=list('ABC'))

In [37]:
df

          A         B         C
0  0.946216  0.200094 -1.198317
1  0.782353  0.679242  0.676833
2 -0.023196 -2.811272  0.801551
3  1.109558  0.142227  0.505166
4  0.806751 -0.638262 -0.146655
5  0.059414 -0.200877 -0.446573
6 -0.099611  0.051243 -1.385004
7 -1.153406  0.954165 -1.656428

In [38]:
df*5 + 2

          A          B         C
0  6.731080   3.000472 -3.991585
1  5.911766   5.396212  5.384165
2  1.884022 -12.056358  6.007753
3  7.547789   2.711135  4.525832
4  6.033756  -1.191309  1.266726
5  2.297069   0.995614 -0.232867
6  1.501946   2.256216 -4.925018
7 -3.767029   6.770826 -6.282138

In [39]:
df ** 4

              A          B         C
0  8.016063e-01   0.001603  2.061992
1  3.746376e-01   0.212863  0.209858
2  2.894868e-07  62.461336  0.412785
3  1.515653e+00   0.000409  0.065124
4  4.236026e-01   0.165957  0.000463
5  1.246092e-05   0.001628  0.039771
6  9.845216e-05   0.000007  3.679626
7  1.769817e+00   0.828885  7.528176

In [40]:
df1 = pd.DataFrame({'a': [1, 0, 1], 'b': [0, 1, 1]}, dtype=bool)
df2 = pd.DataFrame({'a': [0, 1, 1], 'b': [1, 1, 0]}, dtype=bool)

In [41]:
df1

       a      b
0   True  False
1  False   True
2   True   True

In [42]:
df2

       a      b
0  False   True
1   True   True
2   True  False

In [43]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [44]:
dft = pd.DataFrame({'A': np.random.rand(3),
                        'B': 1,
                        'C': 'foo',
                        'D': pd.Timestamp('20010102'),
                        'E': pd.Series([1.0] * 3).astype('float32'),
                        'F': False,
                        'G': pd.Series([1] * 3, dtype='int8')})

In [45]:
dft

          A  B    C          D    E      F  G
0  0.980698  1  foo 2001-01-02  1.0  False  1
1  0.480043  1  foo 2001-01-02  1.0  False  1
2  0.643443  1  foo 2001-01-02  1.0  False  1

In [47]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

In [48]:
df1 = pd.DataFrame(np.random.randn(8,1), columns = ['A'], dtype = 'float32')

In [49]:
df1

          A
0  0.054119
1  0.126404
2 -0.838103
3  0.220015
4 -0.068742
5  1.610043
6 -0.882891
7  0.824641

In [51]:
df1 = df1.astype('float64')

In [53]:
df1.dtypes

A    float64
dtype: object

In [55]:
df = pd.DataFrame(np.random.randn(8, 3),
                      columns=['A', 'B', 'C'])

In [56]:
df.columns = [x.lower() for x in df.columns]
df

          a         b         c
0 -1.172031  0.377485 -0.716463
1 -0.934459 -0.166549  0.112169
2 -0.152731 -0.687212 -0.764175
3 -0.192034  1.236272  0.067558
4  0.477629  0.854438  0.258032
5 -0.727521  1.891280  1.115335
6 -0.224935  0.085719  1.722936
7 -1.277912 -0.330494  0.437270

In [57]:
df

          a         b         c
0 -1.172031  0.377485 -0.716463
1 -0.934459 -0.166549  0.112169
2 -0.152731 -0.687212 -0.764175
3 -0.192034  1.236272  0.067558
4  0.477629  0.854438  0.258032
5 -0.727521  1.891280  1.115335
6 -0.224935  0.085719  1.722936
7 -1.277912 -0.330494  0.437270

In [58]:
df.a.array

<PandasArray>
[ -1.1720305373601285,   -0.934459407490865, -0.15273126888142044,
 -0.19203366105863612,   0.4776289213767569,  -0.7275214412923597,
  -0.2249347353324716,  -1.2779116486663002]
Length: 8, dtype: float64

In [59]:
data = np.random.randint(0, 7, size=50)
data

array([1, 4, 6, 4, 6, 1, 5, 0, 5, 3, 6, 5, 0, 2, 5, 4, 2, 6, 2, 1, 4, 2,
       5, 0, 6, 2, 4, 6, 4, 1, 5, 4, 6, 2, 6, 4, 5, 3, 6, 0, 0, 1, 5, 5,
       0, 3, 5, 6, 2, 2])

In [60]:
s=pd.Series(data)

In [61]:
s.value_counts()

6    10
5    10
4     8
2     8
0     6
1     5
3     3
dtype: int64

In [62]:
s5 = pd.Series([1, 1, 3, 3, 3, 5, 5, 7, 7, 7])
s5.mode()

0    3
1    7
dtype: int64

In [65]:
df5 = pd.DataFrame({"A": np.random.randint(0, 7, size=50), "B": np.random.randint(-10, 15, size=50)})

In [64]:
df5.mode()

   A  B
0  4  1

In [66]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [67]:
s.reindex(['e', 'b', 'f', 'd'])

e   -0.444630
b    0.774698
f         NaN
d    0.481426
dtype: float64

In [68]:
df = pd.DataFrame({
     'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
     'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
     'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [69]:
df.reindex(index=['c', 'f', 'b'], columns=['three', 'two', 'one'])

     three       two       one
c -1.53186  0.633934 -0.843506
f      NaN       NaN       NaN
b -0.18864 -0.978799  0.295186

In [70]:
df.reindex(['c', 'f', 'b'], axis='index')

        one       two    three
c -0.843506  0.633934 -1.53186
f       NaN       NaN      NaN
b  0.295186 -0.978799 -0.18864

In [71]:
df

        one       two     three
a  0.061456 -0.100101       NaN
b  0.295186 -0.978799 -0.188640
c -0.843506  0.633934 -1.531860
d       NaN -1.103829 -0.082169

In [72]:
df.drop(['a', 'd'], axis=0)

        one       two    three
b  0.295186 -0.978799 -0.18864
c -0.843506  0.633934 -1.53186

In [73]:
df.drop(['one'], axis=1)

        two     three
a -0.100101       NaN
b -0.978799 -0.188640
c  0.633934 -1.531860
d -1.103829 -0.082169

In [74]:
s

a   -0.564476
b    0.774698
c    0.315455
d    0.481426
e   -0.444630
dtype: float64

In [75]:
s.rename(str.upper)

A   -0.564476
B    0.774698
C    0.315455
D    0.481426
E   -0.444630
dtype: float64

In [76]:
df.rename(columns={'one': 'foo', 'two': 'bar'},
              index={'a': 'apple', 'b': 'banana', 'd': 'durian'})

             foo       bar     three
apple   0.061456 -0.100101       NaN
banana  0.295186 -0.978799 -0.188640
c      -0.843506  0.633934 -1.531860
durian       NaN -1.103829 -0.082169

In [77]:
df.rename({'a': 'apple', 'b': 'banana', 'd': 'durian'}, axis='index')

             one       two     three
apple   0.061456 -0.100101       NaN
banana  0.295186 -0.978799 -0.188640
c      -0.843506  0.633934 -1.531860
durian       NaN -1.103829 -0.082169

In [78]:
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))

In [79]:
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [80]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int64

In [81]:
s.dt.second

0    12
1    12
2    12
3    12
dtype: int64

In [82]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

In [83]:
df = pd.DataFrame(np.random.randn(8, 3),
                      columns=['A', 'B', 'C'])

In [84]:
df

          A         B         C
0  0.897895  2.571305 -0.166499
1 -0.492545  0.028245 -1.232120
2  0.328915  0.275877  1.580863
3  0.341838  1.073385  0.044346
4 -1.964594  0.299991  0.614756
5 -2.282578 -1.493967  1.513467
6 -0.178925 -1.333900  0.590417
7 -0.353045 -0.254465 -1.294186

In [86]:
df.A.array

<PandasArray>
[  0.8978946997357036,  -0.4925449834928039,   0.3289145320348461,
   0.3418382453324495,  -1.9645944253603733,  -2.2825780081642852,
  -0.1789252798580684, -0.35304459932278126]
Length: 8, dtype: float64

In [87]:
df = pd.DataFrame({
     'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
     'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
     'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [88]:
df

        one       two     three
a -0.153690 -0.301754       NaN
b  2.018217  0.716505 -0.237605
c -1.460754 -0.216642  1.073069
d       NaN -1.839757  2.405252

In [89]:
df.reindex(index=['c', 'f', 'b'], columns=['three', 'two', 'one'])

      three       two       one
c  1.073069 -0.216642 -1.460754
f       NaN       NaN       NaN
b -0.237605  0.716505  2.018217

In [90]:
df

        one       two     three
a -0.153690 -0.301754       NaN
b  2.018217  0.716505 -0.237605
c -1.460754 -0.216642  1.073069
d       NaN -1.839757  2.405252

In [91]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [92]:
unsorted_df = df.reindex(index=['a', 'd', 'c', 'b'],
                          columns=['three', 'two', 'one'])

In [93]:
unsorted_df

      three       two       one
a       NaN  0.517158  0.449998
d  1.218897  0.010476       NaN
c  0.085647 -1.375745  0.289752
b -1.801040 -2.248978 -0.233943

In [95]:
unsorted_df.sort_index()

      three       two       one
a       NaN  0.517158  0.449998
b -1.801040 -2.248978 -0.233943
c  0.085647 -1.375745  0.289752
d  1.218897  0.010476       NaN

In [96]:
unsorted_df.sort_index(ascending=False)

      three       two       one
d  1.218897  0.010476       NaN
c  0.085647 -1.375745  0.289752
b -1.801040 -2.248978 -0.233943
a       NaN  0.517158  0.449998

In [99]:
unsorted_df.sort_index(axis=1)

        one     three       two
a  0.449998       NaN  0.517158
d       NaN  1.218897  0.010476
c  0.289752  0.085647 -1.375745
b -0.233943 -1.801040 -2.248978

In [100]:
unsorted_df['three'].sort_index()

a         NaN
b   -1.801040
c    0.085647
d    1.218897
Name: three, dtype: float64

In [101]:
df1 = pd.DataFrame({'one': [2, 1, 1, 1],
                        'two': [1, 3, 2, 4],
                        'three': [5, 4, 3, 2]})

In [102]:
df1

   one  two  three
0    2    1      5
1    1    3      4
2    1    2      3
3    1    4      2

In [103]:
df1[['one', 'two', 'three']].sort_values(by=['one', 'two'])

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

In [104]:
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [105]:
s[2] = np.nan

In [106]:
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2                   NaT
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [107]:
s.sort_values()

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
3   2013-01-04 09:10:12
2                   NaT
dtype: datetime64[ns]

In [108]:
idx = pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('a', 2),
                                   ('b', 2), ('b', 1), ('b', 1)])

In [109]:
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 2),
            ('b', 2),
            ('b', 1),
            ('b', 1)],
           )

In [110]:
 idx.names = ['first', 'second']

In [111]:
 df_multi = pd.DataFrame({'A': np.arange(6, 0, -1)},
                            index=idx)

In [112]:
 df_multi.sort_values(by=['second', 'A'])

              A
first second
b     1       1
      1       2
a     1       6
b     2       3
a     2       4
      2       5

In [113]:
%pwd

'C:\\Users\\jesse\\Downloads\\lighthouse-data-notes\\Week_1\\Day_6'

In [114]:
for i in range(4):
    for j in range(4):
        print(i,j)

0 0
0 1
0 2
0 3
1 0
1 1
1 2
1 3
2 0
2 1
2 2
2 3
3 0
3 1
3 2
3 3